# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Tsubasa Maruyama\Documents\PSoC Creator\Lticker\Lticker.cydsn\Lticker.cyprj
# Date: Sat, 13 Sep 2014 08:21:23 GMT
#set_units -time ns
create_clock -name {CyHFCLK} -period 25 -waveform {0 12.5} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list [get_pins {ClockBlock/udb_div_0}]]
create_clock -name {CyIMO} -period 25 -waveform {0 12.5} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 25 -waveform {0 12.5} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Tsubasa Maruyama\Documents\PSoC Creator\Lticker\Lticker.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Tsubasa Maruyama\Documents\PSoC Creator\Lticker\Lticker.cydsn\Lticker.cyprj
# Date: Sat, 13 Sep 2014 08:21:18 GMT
